/*2452654 郭炫君 电信*/
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量、宏定义
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：输出位数、正序、逆序
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
void output(int k)
{
	if (k == 0) {
        cout << "1位数" << endl;
        cout << "每位数字分别是 : " << endl;
        cout << 0 << endl;
        cout << "逆序输出的每位数字分别是 : " << endl;
        cout << 0 << endl;
        return;
	}
	int k1=k;
	int weishu=0;
	while (k1>0) {
		weishu+=1;
		k1/=10;
	}
	cout<<weishu<<"位数"<<endl;
	
	cout<<"每位数字分别是 : "<<endl;
	k1=k;
	int a=1;
	for (int i=1;i<weishu;i+=1){
		a*=10;
	}
	while (a>0){
		cout<<(k1/a);
		if (a > 1) 
			cout << " ";
		k1%=a;
		a/=10;
	}
	cout<<endl;
	
	cout<<"逆序输出的每位数字分别是 : "<<endl;
	bool first=true;
	while (k>0){
		if (!first)
		cout<<" ";
		cout<<k%10;
		k/=10;
		first=false;
	}
	cout<<endl;
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得[0..99999]之间的整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input(void)
{
	int num;
	while(1){
		cout<<"请输入一个[0..99999]间的整数"<<endl;
		cin>>num;
		if (cin.fail()){
			cin.clear();
			cin.ignore(1024,'\n');
			continue;
		}
		
		if(num>=0&&num<=99999){
			return num;
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int k;

	k = input();
	output(k);

	return 0;
}
